app/controllers/kit_products_controller.rb

SELECT * FROM "kits" WHERE ("kits"."id" = 16)
INSERT INTO "kit_products" ("created_at", "product_id", "updated_at", "kit_id") VALUES('2012-05-29 17:26:17', 6, '2012-05-29 17:26:17', 16)
SELECT "products".* FROM "products" INNER JOIN kit_products ON products.id = kit_products.product_id WHERE (("kit_products".kit_id = 16))
---
  def create
    @kit = Kit.find(params[:kit_id])

    respond_to do |format|
      if @kit.products << Product.find(params[:product_id])

SELECT * FROM "kit_products" WHERE ("kit_products"."id" = 4)
DELETE FROM "kit_products" WHERE "id" = 4
---
  def destroy
    @kit_product = KitProduct.find(params[:id])
    @kit_product.destroy