app/controllers/kits_controller.rb

  def show
    @kit = Kit.find(params[:id])
---
SELECT * FROM "kits" WHERE (id = 1 or ancestry like '1/%' or ancestry = '1') ORDER BY (case when ancestry is null then 0 else 1 end), ancestry, created_at

  def edit
    @kit = Kit.find(params[:id])
---
SELECT * FROM "kits" WHERE ("kits"."id" = 11)

  def create
    if params[:kit_id]
      @kit = Kit.find(params[:kit_id])
      @kit.children.create(params[:kit])
---
INSERT INTO "kits" ("created_at", "title", "ancestry", "updated_at") VALUES('2012-05-26 05:56:16', 'Blahhh', NULL, '2012-05-26 05:56:16')

  def update
    @kit = Kit.find(params[:id])

    if params[:child]
      @child_kit = Kit.find(params[:child])
      @child_kit.parent = @kit
      @child_kit.save
---
SELECT * FROM "kits" WHERE (ancestry like '4/%' or ancestry = '4')
UPDATE "kits" SET "updated_at" = '2012-05-26 09:23:50', "title" = 'Kit 15' WHERE "id" = 15

  def destroy
    @kit = Kit.find(params[:id])
    @kit.destroy
---
SELECT * FROM "kits" WHERE (ancestry like '10/%' or ancestry = '10')
DELETE FROM "kits" WHERE "id" = 10