app/controllers/products_controller.rb

SELECT * FROM "kits" WHERE ("kits"."id" = 1)
SELECT "products".* FROM "products" INNER JOIN kit_products ON products.id = kit_products.product_id WHERE (("kit_products".kit_id = 1))
---
  def index
    if params[:kit_id]
      @kit = Kit.find(params[:kit_id])
      @products = @kit.products
    else
      @products = Product.find(:all)

SELECT * FROM "products" WHERE ("products"."id" = 11)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "title", "updated_at", "kit_id") VALUES('2012-05-29 16:24:10', 'TEST Blahhhh', '2012-05-29 16:24:10', NULL)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 11)
UPDATE "products" SET "updated_at" = '2012-05-29 16:24:55', "title" = 'TEST 11' WHERE "id" = 11
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 1)
DELETE FROM "products" WHERE "id" = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy